Repository: abdallah-gaber/q4-board
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Q4 Board
ar: لوحة الأولويات

source: Board
ar: اللوحة

source: Settings
ar: الإعدادات

# searchHint
source: Search notes
ar: ابحث في الملاحظات

source: Show done
ar: إظهار المكتمل

# filterAll
source: All
ar: الكل

# filterHideDone
source: Hide done
ar: إخفاء المكتمل

# doneFilterControl
source: Done items filter
ar: فلتر المهام المكتملة

source: Add note
ar: إضافة ملاحظة

source: Edit note
ar: تعديل الملاحظة

source: Delete
ar: حذف

source: Undo
ar: تراجع

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Title
ar: العنوان

source: Description
ar: الوصف

source: Due date
ar: تاريخ الاستحقاق

source: No due date
ar: بدون تاريخ

# markDone
source: Done
ar: مكتمل

source: Move to
ar: نقل إلى

source: Theme mode
ar: وضع المظهر

# themeSystem
source: System
ar: النظام

# themeLight
source: Light
ar: فاتح

# themeDark
source: Dark
ar: داكن

source: Language
ar: اللغة

# languageSystem
source: System
ar: النظام

# languageEnglish
source: English
ar: الإنجليزية

# languageArabic
source: Arabic
ar: العربية

source: Default show done
ar: الإعداد الافتراضي لإظهار المكتمل

source: Sync (coming soon)
ar: المزامنة (قريبًا)

# syncComingSoonDesc
source: Firebase auth + cloud sync will be added in Phase 2.
ar: تسجيل الدخول والمزامنة السحابية عبر Firebase ستضاف في المرحلة الثانية.

# syncSectionTitle
source: Cloud Sync
ar: المزامنة السحابية

# syncUnavailable
source: Cloud sync unavailable
ar: المزامنة السحابية غير متاحة

# syncConnected
source: Cloud sync ready
ar: المزامنة السحابية جاهزة

# syncNotSignedIn
source: Sign in to enable cloud sync
ar: سجّل الدخول لتفعيل المزامنة السحابية

# syncNotConfiguredHelp
source: Firebase is not configured yet. Run FlutterFire configure and replace firebase_options.dart.
ar: لم يتم إعداد Firebase بعد. شغّل FlutterFire configure واستبدل ملف firebase_options.dart.

# syncSignIn
source: Sign in
ar: تسجيل الدخول

# syncSignOut
source: Sign out
ar: تسجيل الخروج

# syncPush
source: Push
ar: رفع

# syncPull
source: Pull
ar: سحب

# syncSignedIn
source: Signed in successfully
ar: تم تسجيل الدخول بنجاح

# syncSignedOut
source: Signed out
ar: تم تسجيل الخروج

# syncErrorGeneric
source: Cloud sync action failed
ar: فشلت عملية المزامنة السحابية

# syncErrorTimeout
source: Sync timed out. Please try again.
ar: انتهت مهلة المزامنة. حاول مرة أخرى.

# syncErrorTimeoutHelp
source: The operation took too long. Check your connection and retry.
ar: استغرقت العملية وقتًا طويلًا. تحقّق من الاتصال ثم أعد المحاولة.

# syncErrorNetwork
source: Network unavailable. Check your connection and try again.
ar: الشبكة غير متاحة. تحقّق من الاتصال ثم حاول مرة أخرى.

# syncErrorNetworkHelp
source: Network issue detected. Verify connectivity, then retry.
ar: تم اكتشاف مشكلة في الشبكة. تحقّق من الاتصال ثم أعد المحاولة.

# syncErrorPermissionDenied
source: Cloud sync denied by Firestore rules
ar: تم رفض المزامنة بواسطة قواعد Firestore

# syncErrorPermissionDeniedHelp
source: Firestore rules blocked this action. Confirm rules allow users/<uid>/notes for the signed-in user.
ar: قواعد Firestore منعت العملية. تأكد أن القواعد تسمح بالمسار users/<uid>/notes للمستخدم الحالي.

# syncErrorAuthRequired
source: Sign in is required before sync
ar: يلزم تسجيل الدخول قبل المزامنة

# syncErrorAuthOperationNotAllowed
source: Anonymous sign-in is disabled in Firebase Auth
ar: تسجيل الدخول المجهول غير مفعّل في Firebase Auth

# syncErrorAuthOperationHelp
source: Enable Anonymous sign-in in Firebase Console > Authentication > Sign-in method.
ar: فعّل Anonymous Sign-in من Firebase Console > Authentication > Sign-in method.

# syncErrorFirestoreSetup
source: Firestore is not ready for this project yet
ar: قاعدة Firestore غير جاهزة لهذا المشروع بعد

# syncErrorTooManyRequests
source: Too many requests. Please wait and retry.
ar: عدد الطلبات كبير جدًا. انتظر قليلًا ثم أعد المحاولة.

# syncErrorRetryHint
source: You can retry the last sync action after fixing the issue.
ar: يمكنك إعادة محاولة آخر عملية مزامنة بعد إصلاح السبب.

# syncRetrySuccess
source: Retried sync action
ar: تمت إعادة محاولة عملية المزامنة

# retryAction
source: Retry
ar: إعادة المحاولة

# syncStatusUnavailable
source: Firebase is unavailable (local-only mode).
ar: Firebase غير متاح (وضع محلي فقط).

# syncStatusIdle
source: Idle
ar: جاهز

# syncStatusAuthRequired
source: Authentication required
ar: يلزم تسجيل الدخول

# syncStatusPushing
source: Pushing local notes to cloud...
ar: جارٍ رفع الملاحظات المحلية إلى السحابة...

# syncStatusPulling
source: Pulling cloud notes to this device...
ar: جارٍ سحب الملاحظات السحابية إلى هذا الجهاز...

# syncStatusLiveActive
source: Live sync is active
ar: المزامنة الحية مفعّلة

# syncStatusLiveStopped
source: Live sync stopped
ar: تم إيقاف المزامنة الحية

# syncStatusLiveApplied
source: Live sync applied remote changes
ar: تم تطبيق التغييرات السحابية تلقائيًا

# syncStatusLiveAppliedConflicts
source: Live sync applied (newer local changes were kept)
ar: تم تطبيق المزامنة الحية (مع الاحتفاظ بالتعديلات المحلية الأحدث)

# syncStatusSuccess
source: Sync completed
ar: اكتملت المزامنة

# syncStatusError
source: Sync failed
ar: فشلت المزامنة

# syncStatusPushComplete
source: Push completed
ar: اكتمل الرفع

# syncStatusPullComplete
source: Pull completed
ar: اكتمل السحب

# syncStatusPushCompleteConflicts
source: Push completed (newer cloud changes were kept)
ar: اكتمل الرفع (تم الاحتفاظ بالتعديلات الأحدث في السحابة)

# syncStatusPullCompleteConflicts
source: Pull completed (newer local changes were kept)
ar: اكتمل السحب (تم الاحتفاظ بالتعديلات الأحدث محليًا)

# syncStatusPullRemoteEmptyLocalKept
source: Cloud is empty; local notes were kept (safety check)
ar: السحابة فارغة؛ تم الاحتفاظ بالملاحظات المحلية (حماية من الحذف)

# syncUserId
source: User: {userId}
ar: المستخدم: {userId}

# syncPushDone
source: Push complete: {upserts} updated, {deletes} removed, {skipped} conflicts skipped
ar: اكتمل الرفع: تم تحديث {upserts}، وحذف {deletes}، وتخطي {skipped} تعارضات

# syncPullDone
source: Pull complete: {upserts} updated, {deletes} removed locally, {skipped} conflicts skipped
ar: اكتمل السحب: تم تحديث {upserts}، وحذف {deletes} محليًا، وتخطي {skipped} تعارضات

# q1Title
source: Important & Urgent
ar: مهم وعاجل

# q2Title
source: Important & Not Urgent
ar: مهم وغير عاجل

# q3Title
source: Not Important & Urgent
ar: غير مهم وعاجل

# q4Title
source: Not Important & Not Urgent
ar: غير مهم وغير عاجل

# q1Label
source: DO FIRST
ar: ابدأ الآن

# q2Label
source: SCHEDULE
ar: خطط له

# q3Label
source: DELEGATE
ar: فوّضه

# q4Label
source: DON'T DO
ar: استبعده

# q1TabSemantics
source: Do first quadrant
ar: قسم ابدأ الآن

# q2TabSemantics
source: Schedule quadrant
ar: قسم خطط له

# q3TabSemantics
source: Delegate quadrant
ar: قسم فوّضه

# q4TabSemantics
source: Don't do quadrant
ar: قسم استبعده

# emptyQuadrant
source: No notes yet
ar: لا توجد ملاحظات بعد

# emptySearch
source: No results for your search
ar: لا نتائج مطابقة للبحث

source: Note deleted
ar: تم حذف الملاحظة

source: Note moved
ar: تم نقل الملاحظة

# requiredTitle
source: Title is required
ar: العنوان مطلوب

# clearDueDate
source: Clear date
ar: مسح التاريخ

source: Pick date
ar: اختيار تاريخ

# doneChip
source: Done
ar: منجز

source: Drag to reorder
ar: اسحب لإعادة الترتيب

source: Load demo data
ar: تحميل بيانات تجريبية

# loadDemoDataDesc
source: Replace local notes with curated demo content for screenshots.
ar: استبدال الملاحظات المحلية ببيانات جاهزة لالتقاط لقطات الشاشة.

# demoDataLoaded
source: {count} demo notes loaded
ar: تم تحميل {count} ملاحظات تجريبية

source: Reset local data
ar: إعادة ضبط البيانات المحلية

# resetLocalDataDesc
source: Clear all notes and settings saved on this device.
ar: يمسح كل الملاحظات والإعدادات المحفوظة على هذا الجهاز.

# resetLocalDataConfirmTitle
source: Reset local data?
ar: إعادة ضبط البيانات؟

# resetLocalDataConfirmBody
source: This will permanently remove your notes and settings from this device.
ar: سيؤدي هذا إلى حذف كل الملاحظات والإعدادات نهائيًا من هذا الجهاز.

# resetAction
source: Reset
ar: إعادة ضبط

# localDataResetSuccess
source: Local data has been reset
ar: تمت إعادة ضبط البيانات المحلية
